{
  "lang": "English",
  "level": "A2",
  "challenges": [
    {
      "id": "tsg001",
      "evidence1": "A single muddy boot is found by the front door.",
      "hypothesis_prompt1": "Based on this, what do you think happened?",
      "evidence2": "Next to the boot is a ticket stub for a train that arrived from the countryside this morning.",
      "hypothesis_prompt2": "Now what do you think happened? Revise your hypothesis.",
      "model_hypothesis": "Someone who lives here, or a visitor, has just returned from a trip to the countryside. They were in a muddy place before they came back."
    },
    {
      "id": "tsg002",
      "evidence1": "On the kitchen table, there is a torn letter. You can only read the words '...I can't believe you...' and '...never forgive...'",
      "hypothesis_prompt1": "What do you think this letter is about?",
      "evidence2": "You look at the envelope. It's from a company that sells lottery tickets.",
      "hypothesis_prompt2": "How does this change your idea? What is the letter about now?",
      "model_hypothesis": "Someone in the house was very angry about a lottery result. Maybe they thought they won, but they didn't, or maybe they are angry that someone spent money on lottery tickets."
    },
    {
      "id": "tsg003",
      "evidence1": "You find a grocery receipt on the floor of the car. It lists: one birthday cake, 21 candles, and a bottle of expensive champagne.",
      "hypothesis_prompt1": "What event are these groceries for?",
      "evidence2": "You also find a small, empty ring box tucked into the side pocket of the car door.",
      "hypothesis_prompt2": "What do you think is happening now?",
      "model_hypothesis": "It's likely a surprise 21st birthday party where someone is also planning to propose. It's a double celebration."
    },
    {
      "id": "tsg004",
      "evidence1": "The dog's water bowl is empty, and there are scratch marks on the back door.",
      "hypothesis_prompt1": "What does the dog want?",
      "evidence2": "You hear a loud clap of thunder outside.",
      "hypothesis_prompt2": "What might be the reason for the dog's behavior now?",
      "model_hypothesis": "The dog is not just thirsty; it's probably scared of the thunderstorm and wants to be let inside to feel safe. The scratching might be from panic."
    }
  ]
}
